//常量
#define MAX 10000

enum SEX {
	//这种枚举类型的变量的未来可能取值
	//枚举常量 
	MALE = 3, // 赋初值
	FEMALE,
	SECRET
};
int main() {
	//***************************************************************************
	//1.字面常量                                                                 *
	//                                                                          *
	//3.14;                                                                     *
	//10;                                                                       *
	//'a';                                                                      *
	//"abcdef";                                                                 *
	//***************************************************************************
	//2.const修饰的常变量                                                        *
	//                                                                          *  
	//const int num = 10; //num就是常变量 - 具有常属性（不能被改变的属性）          *
	//num = 20;                                                                 *
	//printf("num = %d\n", num);                                                *
	//int arr[10] = { 0 }; // 十个元素                                           *
	//const int n = 10;                                                         *	                                                                            * 
	//int arr2[n] = { 0 }; //n是变量的，这里是不行                                * 
	//***************************************************************************
	//3. #define 定义的标识符常量                                                 *
	//MAX = 20000; //err                                                        * 
	//int n = MAX;                                                              *
	//printf("n = %d\n", n);                                                    *
	//***************************************************************************
	//4.枚举常量
	//可以一一列举的常量

	enum SEX s = MALE;
	//MALE = 3; //err
	printf("%d\n", MALE);  
	printf("%d\n", FEMALE);
	printf("%d\n", SECRET);


	return 0;
}  
